Autodesk.Revit.UI.Events.TaskDialogShowingEventArgs.DialogId
String ID associated with the task dialog.

Autodesk.Revit.UI.Events.TaskDialogShowingEventArgs.Message
The message provided by the task dialog.

Autodesk.Revit.UI.Events.TaskDialogShowingEventArgs
The event arguments used by the DialogBoxShowing event when a Revit task dialog that prompts the user
for some action is shown.
Remarks:
When the application receives this object, a task dialog is about to be displayed in Revit that
requires user interaction. The OverrideResult function can be used to cause the dialog
to be dismissed and return a desired result code.